#+TITLE: Test scripts for modular StructOpt

** write_xyz
#+BEGIN_SRC python :tangle fileio/write_xyz-test.py
import sys; sys.path.insert(1, '../')
from structopt.fileio import write_xyz

from ase.lattice import bulk
from ase.visualize import view

atoms = bulk('Pt')
write_xyz('fileio/write_xyz-test.xyz', atoms, append=False)

with open('fileio/write_xyz-test.xyz') as f:
    print(f.read())

#+END_SRC

#+RESULTS:
: 1
: 0
: Pt      0.000000000000000      0.000000000000000      0.000000000000000
: 

* Test Au18 run

#+BEGIN_SRC python
import json
import random
import numpy as np
from ase import Atom, Atoms
from ase.visualize import view
from ase.data import reference_states

# First the initial population, which should form a sphere
atomlist = (['Au', 18, 0, 0])

def random_three_vector():
    """Generates a random 3D unit vector (direction) with a 
    uniform spherical distribution
    Algo from http://stackoverflow.com/questions/5408276/python-uniform-spherical-distribution
    :return:
    """
    
    phi = np.random.uniform(0,np.pi*2)
    costheta = np.random.uniform(-1,1)

    theta = np.arccos( costheta )
    x = np.sin( theta) * np.cos( phi )
    y = np.sin( theta) * np.sin( phi )
    z = np.cos( theta )
    return (x,y,z)

def get_particle_radius(atomlist, f=0.7):
    """Returns an estimated nanoparticle radius given a
    concentration of atoms and void fraction of the sphere.
    """

    # Get the average lattice constant
    n = sum([atom[1] for atom in atomlist])
    lat = 0
    for atom in atomlist:
        

print(get_particle_radius(atomlist, 
    
def generate_sphere(atomlist, radius=None, min_dist=1.0, 
                    tries_b4_expand=100):
    """Generates a random sphere of particles given an atomlist, 
    number of atoms
    """
    
    indiv = Atoms()
    for i in range(n):
        # Always add the first atom to the origin
        if i == 0:
            indiv.append(Atom('Au', (0, 0, 0)))
            continue

        # We want to assure atoms are not close together. We do this
        # by trial and error. At a certain point, we expand the radius
        # and try again. This is 
        j = 0
        while j <= tries_b4_expand:
            
            # Get a random coordinate in the sphere
            unit_vec = np.array(random_three_vector())
            D = radius * random.uniform(0, 1.0) ** (1.0/3.0)
            coord = unit_vec * D

            # Check the distances with other atoms
            pos = indiv.get_positions()
            dists = [np.linalg.norm(xyz - coord) for xyz in pos]
	    if min(dists) < min_dist and j < tries_b4_expand:
                j += 1
            elif j == tries_b4_expand:
                print('expanded')
                radius *= 1.1
                j = 0
            else:
                break

        indiv.append(Atom('Au', coord))

    return indiv

# for i in range(nindiv):
#     indiv = generate_sphere(radius, n)
#     view(indiv)
    
#+END_SRC

#+RESULTS:
: 1.00995049384

* Writing a new generate sphere class
#+BEGIN_SRC python
import json
import random
import numpy as np
from ase import Atom, Atoms
from ase.visualize import view
from ase.data import atomic_numbers, reference_states

class Sphere(object):
    """Class that handles the generation of a sphere."""

    def __init__(self, atomlist, **kwargs):
        self.atomlist = atomlist
        self.fill_factor = 0.7
        self.radius = None
        self.min_dist_factor = 0.7
        self.tries_b4_expand = 100
        
        for kw in kwargs:
            setattr(self, kw, kwargs[kw])
    
    def random_three_vector(self):
        """Generates a random 3D unit vector (direction) with a 
        uniform spherical distribution
        Algo from http://stackoverflow.com/questions/5408276/python-uniform-spherical-distribution
        :return:
        """

        phi = np.random.uniform(0,np.pi*2)
        costheta = np.random.uniform(-1,1)

        theta = np.arccos( costheta )
        x = np.sin( theta) * np.cos( phi )
        y = np.sin( theta) * np.sin( phi )
        z = np.cos( theta )
        return (x,y,z)

    def get_avg_radii(self):
        """Returns the average atomic radius of a list of
        atoms. The radius is the radius of the close packed sphere
        in a given crystal structure
        """

        atomlist = self.atomlist
    
        # Get the average atomic radii of close packed atoms
        n_tot = sum([atom[1] for atom in atomlist])
        r = 0
        for atom in atomlist:
            n = atom[1]
            conc = float(n)/float(n_tot)
            atomic_number = atomic_numbers[atom[0]]
            struct = reference_states[atomic_number]['symmetry']
            if struct == 'fcc':
                a = reference_states[atomic_number]['a']
                r += conc * np.linalg.norm([a, a]) / 4.0
            elif struct == 'bcc':
                a = reference_states[atomic_number]['a']
                r += conc * np.linalg.norm([a, a, a]) / 4.0
            else:
                raise IOError('{} structure not supported yet'.format(struct))

        return r

    def get_particle_radius(self):
        """Returns an estimated nanoparticle radius given a
        concentration of atoms and void fraction of the sphere.
        Given an average sphere, this is given by the formula

        R_sphere = (n_tot / f)**(1.0/3.0) * R_atom

        where n_tot is the total number of atoms and f is
        the fill factor of the particle.
        """

        atomlist = self.atomlist
        fill_factor = self.fill_factor
        
        n_tot = sum([atom[1] for atom in atomlist])
        R_atom = self.get_avg_radii()
        R_sphere = (n_tot / fill_factor)**(1.0/3.0) * R_atom

        return R_sphere

    def get_individual(self):
        """Generates a random sphere of particles given an
        atomlist and radius. If radius is None, one is 
        automatically estimated. min_dist and tries_b4_expand
        are parameters that govern how stricly the proximity
        of atoms are enforced.
        """

        atomlist = self.atomlist
        radius = self.radius
        fill_factor = self.fill_factor
        min_dist_factor = self.min_dist_factor
        tries_b4_expand = self.tries_b4_expand
        
        indiv = Atoms()

        if radius is None:
            radius = self.get_particle_radius()

        avg_radii = self.get_avg_radii()
        min_dist = min_dist_factor * 2 * avg_radii

        # Create a list of random order of the atoms
        all_atoms = []
        for atom in atomlist:
            all_atoms += [atom[0]] * atom[1]

        random.shuffle(all_atoms)

        for i, atom in enumerate(all_atoms):
            # Always add the first atom to the origin
            if i == 0:
                indiv.append(Atom(atom, (0, 0, 0)))            
                continue

            # We want to assure atoms are not close together. We do this
            # by trial and error. At a certain point, we expand the radius
            # and try again. This is 
            j = 0
            while j <= tries_b4_expand:

                # Get a random coordinate in the sphere
                unit_vec = np.array(self.random_three_vector())
                D = radius * random.uniform(0, 1.0) ** (1.0/3.0)
                coord = unit_vec * D

                # Check the distances with other atoms
                pos = indiv.get_positions()
                dists = [np.linalg.norm(xyz - coord) for xyz in pos]
                if min(dists) < min_dist and j < tries_b4_expand:
                    j += 1
                elif j == tries_b4_expand:
                    print('expanded')
                    radius *= 1.1
                    j = 0
                else:
                    break

            indiv.append(Atom(atom, coord))

        return indiv

atomlist = [['Pt', 10, 0, 0]]
generate = Sphere(atomlist, fill_factor=0.7)
atoms = generate.get_individual()
atoms.set_cell([25, 25, 25])
center = np.sum(atoms.get_cell(), axis=0) * 0.5
atoms.translate(center)
view(atoms)
#+END_SRC

#+RESULTS:
#+begin_example
[[ 12.5         12.5         12.5       ]
 [ 11.37285955  11.92191707  10.27191673]
 [ 13.45573718  12.28467891  14.52920171]
 [ 13.50332378  11.12386375  11.17171647]
 [ 10.04685901  13.17104333  12.1535002 ]
 [ 12.01420451   9.90432009  12.17753833]
 [ 14.47921882  10.45909799  12.80449471]
 [ 14.36181325  14.99112536  12.73623534]
 [ 13.42800081  12.81687098  10.09574564]
 [ 11.59305283  12.93757018  15.06574869]]
#+end_example

** Rank
#+BEGIN_SRC python
from copy import deepcopy
import numpy as np
import scipy.stats as ss
"""Grefenstette and Baker 1989 Whitley 1989"""

repeat_parents = False

np.random.seed(0)

p_min = 0.01

# Get ranks of each population value based on its fitness
fits = range(10)
np.random.shuffle(fits)
ranks = ss.rankdata(fits)

# Get probabilities based on linear ranking
N = len(fits)
eta_min = p_min * N
eta_max = 2 - eta_min
p_max = eta_max / N
ps = p_min + (p_max - p_min)*(N - ranks)/(N - 1)

# Construct list of parents
n_pairs = int(len(fits) / 2)
pairs = []

for i in range(n_pairs):
    # Choose the first parent based on probabilties
    father = np.random.choice(fits, p=ps)

    # Choose the second parent based on renormalized probabilities
    # First remove the father from the population
    new_fits, new_ps = list(fits), list(ps)
    ind_pop = new_fits.index(father)
    new_fits.pop(ind_pop)
    new_ps.pop(ind_pop)

    # Now remove mothers that would make repeat father/mother pairs
    if not repeat_parents:
        for pair in deepcopy(pairs):
            if father in pair:
                del pair[pair.index(father)]
                mother = pair[0]
                ind_pop = new_fits.index(mother)
                new_fits.pop(ind_pop)
                new_ps.pop(ind_pop)

    new_ps /= sum(new_ps)
    mother = np.random.choice(new_fits, p=new_ps)
    
    print(father, mother)
    pairs.append([father, mother])

print(pairs)
#+END_SRC

#+RESULTS:
: (1, 5)
: (5, 4)
: (0, 1)
: (7, 5)
: (2, 4)
: [[1, 5], [5, 4], [0, 1], [7, 5], [2, 4]]

